select "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД", "Н_ВЕДОМОСТИ"."ИД", "Н_ВЕДОМОСТИ"."ДАТА", "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ"
from "Н_ВЕДОМОСТИ"
    inner join "Н_ТИПЫ_ВЕДОМОСТЕЙ" on "Н_ВЕДОМОСТИ"."ВЕД_ИД" = "ВЕД_ИД"
where "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" > 'Ведомость'
  and "Н_ВЕДОМОСТИ"."ДАТА" > '2010-06-18'
  and "Н_ВЕДОМОСТИ"."ДАТА" < '2022-06-08';

select "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ДАТА", "Н_ВЕДОМОСТИ"."ИД"
from "Н_ЛЮДИ"
    inner join "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ИД"
    join "Н_СЕССИЯ" on "Н_ВЕДОМОСТИ"."СЭС_ИД" = "Н_СЕССИЯ"."СЭС_ИД"
where "Н_ЛЮДИ"."ФАМИЛИЯ" > 'Иванов'
  and "Н_ВЕДОМОСТИ"."ИД" < 1250972;

select "ИМЯ", count("ИМЯ") from "Н_ЛЮДИ" group by "ИМЯ" order by "ИМЯ";

select "ФАМИЛИЯ", "ОТЧЕСТВО" from "Н_ЛЮДИ" where ("ОТЧЕСТВО", "ФАМИЛИЯ")
                                 in (select "ОТЧЕСТВО", "ФАМИЛИЯ"
                                     from "Н_ЛЮДИ" group by "ФАМИЛИЯ", "ОТЧЕСТВО"
                                    having count(*)=1
                                 ) order by "ФАМИЛИЯ";

select count(*) from (select "ФАМИЛИЯ", "ОТЧЕСТВО" from "Н_ЛЮДИ" where ("ОТЧЕСТВО", "ФАМИЛИЯ")
                                 in (select "ОТЧЕСТВО", "ФАМИЛИЯ"
                                     from "Н_ЛЮДИ" group by "ФАМИЛИЯ", "ОТЧЕСТВО"
                                    having count(*)=1
                                 ) order by "ФАМИЛИЯ"
) as rows_count;

select "ФАМИЛИЯ", count("ФАМИЛИЯ") from "Н_ЛЮДИ" group by "ФАМИЛИЯ";
