--1
select "Н_ТИПЫ_ВЕДОМОСТЕЙ"."ИД", "Н_ВЕДОМОСТИ"."ИД", "Н_ВЕДОМОСТИ"."ДАТА", "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ"
from "Н_ВЕДОМОСТИ"
    inner join "Н_ТИПЫ_ВЕДОМОСТЕЙ" on "Н_ВЕДОМОСТИ"."ВЕД_ИД" = "ВЕД_ИД"
where "Н_ТИПЫ_ВЕДОМОСТЕЙ"."НАИМЕНОВАНИЕ" > 'Ведомость'
  and "Н_ВЕДОМОСТИ"."ДАТА" > '2010-06-18'
  and "Н_ВЕДОМОСТИ"."ДАТА" < '2022-06-08';

--2
select "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ДАТА", "Н_ВЕДОМОСТИ"."ИД"
from "Н_ЛЮДИ"
    inner join "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ИД"
    join "Н_СЕССИЯ" on "Н_ВЕДОМОСТИ"."СЭС_ИД" = "Н_СЕССИЯ"."СЭС_ИД"
where "Н_ЛЮДИ"."ФАМИЛИЯ" > 'Иванов'
  and "Н_ВЕДОМОСТИ"."ИД" < 1250972;

select "ИМЯ", count("ИМЯ") from "Н_ЛЮДИ" group by "ИМЯ" order by "ИМЯ";

select "ФАМИЛИЯ", "ОТЧЕСТВО" from "Н_ЛЮДИ" where ("ОТЧЕСТВО", "ФАМИЛИЯ")
                                 in (select "ОТЧЕСТВО", "ФАМИЛИЯ"
                                     from "Н_ЛЮДИ" group by "ФАМИЛИЯ", "ОТЧЕСТВО"
                                    having count(*)=1
                                 ) order by "ФАМИЛИЯ";

--3
select count(*) from (select "ФАМИЛИЯ", "ОТЧЕСТВО" from "Н_ЛЮДИ" where ("ОТЧЕСТВО", "ФАМИЛИЯ")
                                 in (select "ОТЧЕСТВО", "ФАМИЛИЯ"
                                     from "Н_ЛЮДИ" group by "ФАМИЛИЯ", "ОТЧЕСТВО"
                                    having count(*)=1
                                 ) order by "ФАМИЛИЯ"
) as rows_count;

--4 (пофиксить дубликаты ИД)
select "ОТЧЕСТВО", count("ОТЧЕСТВО") from "Н_ЛЮДИ"
    inner join "Н_ОБУЧЕНИЯ" on "Н_ЛЮДИ"."ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
    inner join "Н_УЧЕНИКИ" on "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    inner join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
    inner join "Н_ОТДЕЛЫ" on "Н_ПЛАНЫ"."ОТД_ИД" = "Н_ОТДЕЛЫ"."ОТД_ИД"
where "Н_ОТДЕЛЫ"."ИМЯ_В_ИМИН_ПАДЕЖЕ" = 'кафедра вычислительной техники'
group by "ОТЧЕСТВО"
having count("ОТЧЕСТВО") < 50
order by "ОТЧЕСТВО";

--5
select "Н_ЛЮДИ"."ИД","ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
from "Н_ЛЮДИ"
    join "Н_УЧЕНИКИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" and "Н_УЧЕНИКИ"."ГРУППА" = '4100'
    join "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" and   "ОЦЕНКА" not in('осв','неявка','зачет', 'незач')
group by "Н_ЛЮДИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
having avg(cast("ОЦЕНКА" as numeric)) <= (
    select avg(GRUP.MARK)
    from (
          select avg(cast("ОЦЕНКА" as numeric)) as MARK
    from "Н_УЧЕНИКИ"
        join "Н_ВЕДОМОСТИ" on "Н_УЧЕНИКИ"."ГРУППА" = '1101'
                                  and "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
                                  and "ОЦЕНКА" not in ('осв','неявка','зачет', 'незач')
    ) GRUP);


--6 (Этот работает, но дата неверная)
select "ГРУППА", "ЧЛВК_ИД","ФАМИЛИЯ","ИМЯ","ОТЧЕСТВО","Н_ПЛАНЫ"."НОМЕР"
from "Н_УЧЕНИКИ"
    join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
    join "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                                   and "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
                                   and "КОНЕЦ" = '2012-08-31 00:00:00.00000';
--6 (Тут верная дата, но ответ пустой
select "ГРУППА", "ЧЛВК_ИД","ФАМИЛИЯ","ИМЯ","ОТЧЕСТВО","Н_ПЛАНЫ"."НОМЕР"
from "Н_УЧЕНИКИ"
    join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
    join "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                                   and "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
                                   and "КОНЕЦ" = '2012-09-01 00:00:00.00000';
