select "Н_ЛЮДИ"."ИМЯ", "Н_ВЕДОМОСТИ"."ДАТА", "Н_ВЕДОМОСТИ"."ИД"
from "Н_ЛЮДИ"
    inner join "Н_ВЕДОМОСТИ" on "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ИД"
    join "Н_СЕССИЯ" on "Н_ВЕДОМОСТИ"."СЭС_ИД" = "Н_СЕССИЯ"."СЭС_ИД"
where "Н_ЛЮДИ"."ФАМИЛИЯ" > 'Иванов'
  and "Н_ВЕДОМОСТИ"."ИД" < 1250972;

select "ИМЯ", count("ИМЯ") from "Н_ЛЮДИ" group by "ИМЯ" order by "ИМЯ";

select "ФАМИЛИЯ", "ОТЧЕСТВО" from "Н_ЛЮДИ" where ("ОТЧЕСТВО", "ФАМИЛИЯ")
                                 in (select "ОТЧЕСТВО", "ФАМИЛИЯ"
                                     from "Н_ЛЮДИ" group by "ФАМИЛИЯ", "ОТЧЕСТВО"
                                    having count(*)=1
                                 ) order by "ФАМИЛИЯ";