select "ГРУППА", "ЧЛВК_ИД","ФАМИЛИЯ","ИМЯ","ОТЧЕСТВО","Н_ПЛАНЫ"."НОМЕР"
from "Н_УЧЕНИКИ"
    join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
    join "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                                   and "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
                                   and "КОНЕЦ" = '2012-08-31 00:00:00.00000';
--6 (Тут верная дата, но ответ пустой
select "ГРУППА", "ЧЛВК_ИД","ФАМИЛИЯ","ИМЯ","ОТЧЕСТВО","Н_ПЛАНЫ"."НОМЕР"
from "Н_УЧЕНИКИ"
    join "Н_ПЛАНЫ" on "Н_УЧЕНИКИ"."ПЛАН_ИД" = "Н_ПЛАНЫ"."ПЛАН_ИД"
    join "Н_ЛЮДИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"
    join "Н_ФОРМЫ_ОБУЧЕНИЯ" on "Н_ПЛАНЫ"."ФО_ИД" = "Н_ФОРМЫ_ОБУЧЕНИЯ"."ИД"
                                   and "Н_ФОРМЫ_ОБУЧЕНИЯ"."НАИМЕНОВАНИЕ" = 'Очная'
                                   and "КОНЕЦ" = '2012-09-01 00:00:00.00000';