select "Н_ЛЮДИ"."ИД","ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО", avg(cast("ОЦЕНКА" as numeric))
from "Н_ЛЮДИ"
    join "Н_УЧЕНИКИ" on "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" and "Н_УЧЕНИКИ"."ГРУППА" = '4100'
    join "Н_ВЕДОМОСТИ" on "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД" and   "ОЦЕНКА" not in('осв','неявка','зачет', 'незач')
group by "Н_ЛЮДИ"."ИД", "ФАМИЛИЯ", "ИМЯ", "ОТЧЕСТВО"
having avg(cast("ОЦЕНКА" as numeric)) <= (
    select avg(GRUP.MARK)
    from (
          select avg(cast("ОЦЕНКА" as numeric)) as MARK
    from "Н_УЧЕНИКИ"
        join "Н_ВЕДОМОСТИ" on "Н_УЧЕНИКИ"."ГРУППА" = '1101'
                                  and "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
                                  and "ОЦЕНКА" not in ('осв','неявка','зачет', 'незач')
    ) GRUP);